Revit 2026 API

# BuiltInFailuresViewSheetFailures Class

---

Failures about placing viewports on sheets.

SystemObject Autodesk.Revit.DBBuiltInFailuresViewSheetFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ViewSheetFailures
```
```vb
Public NotInheritable Class ViewSheetFailures
```
```cpp
public ref class ViewSheetFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ViewSheetFailures = class end
```

The BuiltInFailuresViewSheetFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ViewInAModelMustBeUnique | Sheet views in this model cannot contain more than one instance of "%1!s!." |
|  | ViewInAModelMustBeUniqueWarn | Sheet views in this model cannot contain more than one instance of "%1!s!." |
|  | ViewOnASheetCannotBeUncropped3DPerspectiveView | Sheets do not support uncropped perspective views. |
|  | ViewOnASheetMustBeUnique | Sheet views cannot contain more than one instance of "%1!s!." |
|  | ViewOnASheetMustBeUniqueWarn | Sheet views cannot contain more than one instance of "%1!s!." |
|  | ViewportCantContainEmptyView | Sheet views cannot contain empty view "%1!s!". |

#### Reference

Autodesk.Revit.DB Namespace